files/tweak-docker-toolbox/redis-benchmark-2.8-win.txt
====== PING_INLINE ======
  100000 requests completed in 0.94 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 1 milliseconds
100.00% <= 1 milliseconds
105932.20 requests per second

====== PING_BULK ======
  100000 requests completed in 0.91 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
109529.02 requests per second

====== SET ======
  100000 requests completed in 0.97 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.99% <= 1 milliseconds
100.00% <= 1 milliseconds
103092.78 requests per second

====== GET ======
  100000 requests completed in 0.93 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
107526.88 requests per second

====== INCR ======
  100000 requests completed in 0.98 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 1 milliseconds
100.00% <= 1 milliseconds
102040.81 requests per second

====== LPUSH ======
  100000 requests completed in 1.10 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.46% <= 1 milliseconds
99.80% <= 10 milliseconds
99.86% <= 11 milliseconds
99.90% <= 15 milliseconds
99.95% <= 16 milliseconds
99.99% <= 17 milliseconds
100.00% <= 17 milliseconds
91157.70 requests per second

====== LPOP ======
  100000 requests completed in 1.02 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.90% <= 1 milliseconds
99.90% <= 3 milliseconds
99.95% <= 22 milliseconds
99.96% <= 23 milliseconds
99.97% <= 24 milliseconds
99.98% <= 25 milliseconds
99.98% <= 26 milliseconds
99.99% <= 27 milliseconds
99.99% <= 28 milliseconds
100.00% <= 29 milliseconds
100.00% <= 30 milliseconds
97847.36 requests per second

====== SADD ======
  100000 requests completed in 0.98 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 1 milliseconds
102249.49 requests per second

====== SPOP ======
  100000 requests completed in 0.94 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.99% <= 1 milliseconds
100.00% <= 1 milliseconds
106382.98 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 0.98 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 1 milliseconds
102040.81 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 2.57 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.73% <= 1 milliseconds
99.97% <= 2 milliseconds
100.00% <= 2 milliseconds
38925.65 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 6.38 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.06% <= 1 milliseconds
99.50% <= 2 milliseconds
99.84% <= 3 milliseconds
99.85% <= 4 milliseconds
99.85% <= 5 milliseconds
99.88% <= 6 milliseconds
99.94% <= 7 milliseconds
99.95% <= 19 milliseconds
99.97% <= 20 milliseconds
99.99% <= 21 milliseconds
100.00% <= 21 milliseconds
15664.16 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 9.21 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
2.63% <= 2 milliseconds
99.69% <= 3 milliseconds
99.82% <= 4 milliseconds
99.99% <= 5 milliseconds
100.00% <= 5 milliseconds
10855.41 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 11.84 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.05% <= 2 milliseconds
56.81% <= 3 milliseconds
99.85% <= 4 milliseconds
99.95% <= 5 milliseconds
99.98% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 7 milliseconds
8447.37 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 1.50 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.90% <= 1 milliseconds
99.95% <= 8 milliseconds
100.00% <= 8 milliseconds
66800.27 requests per second